MAIN_URL = "https://www.fl.ru/rss/all.xml"

SITES = {
    "category": 2,
    "веб-программирование": 9,
    "сайт под ключ": 27,
    "лендинг": 276,
    "интернет магазины": 217,
    "доработка сайтов": 220,
    "CMS": 86,
    "интеграция по api": 586,
    "корпоративный сайт": 792,
    "сайт-визитка": 793,
    "создание MVP": 584,
}

PROGRAMMING = {
    "category": 5,
    "веб-программирование": 37,
    "прикладное программирование": 1,
    "разработка чат-ботов": 279,
    "парсинг данных": 280,
    "python": 798,
    "системное программирование": 2,
    "создание скриптов": 297,
    "разработка CRM и ERP": 222,
    "плагины/сценарии/утилиты": 221,
    "интеграция по api": 585,
    "интерактивные приложения": 223,
    "создание MVP": 589,
    "прототипирование": 229
}

OUTSOURCING = {
    "category": 13,
    "разработка сайтов": 122,
    "программирование": 124,
    "ERP и CRM интеграции": 230
}

BUSINESS_AUTOMATION = {
    "category": 41,
    "боты для бизнеса": 629,
    "внедрение CRM": 483,
    "ERP-системы": 176,
    "интеграция по API": 587,
    "запись на прием": 627,
    "автоматизация рассылок": 628,
    "складской учет": 499,
    "медицинские учреждения": 489
}

MESSENGERS = {
    "category": 34,
    "telegram": 366,
    "боты для мессенджеров": 380
}

ALL_CATEGORIES = [SITES, PROGRAMMING, OUTSOURCING, BUSINESS_AUTOMATION, MESSENGERS]